# Informe Ocupación Laboral

### 1.1 Importamos los paquetes a usar

In [1]:
import pandas as pd

### 1.2 Importamos los datos a usar

In [2]:
df = pd.read_csv("C:/Users/n_sar/OneDrive/Escritorio/Nathye/Data Science/Datasets/ds_filt.csv"
           , encoding = 'latin1')

## 2. Explorando el dataset

### 2.1. ¿Cuántas filas y cuántas columnas tiene el dataset?

In [3]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23448 entries, 0 to 23447
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   ch06      23448 non-null  int64
 1   nivel_ed  23448 non-null  object
 2   htot      23448 non-null  int64
 3   calif     23448 non-null  object
 4   p47t      23448 non-null  float64
dtypes: float64(1), int64(2), object(2)
memory usage: 916.1+ KB
None

### 2.2 ¿Qué información tiene el dataset? Imprimir el nombre de las columnas

In [4]:
df.columns.values

array(['ch06', 'nivel_ed', 'htot', 'calif', 'p47t'], dtype=object)

Los nombres de columna no son muy descriptivos de la información que contienen las mismas. Probemos cambiarlos por la siguiente lista: 

['edad', 'nivel_educativo', 'hs_trabajadas', 'calif_ocupacional', 'ingreso_ult_mes']

### 2.3 ¿Cómo está indexado el dataset?

In [5]:
df.rename( columns={"ch06" :'edad'}, inplace=True)
df.rename( columns={"nivel_ed" :'nivel_educativo'}, inplace=True)
df.rename( columns={"htot" :'hs_trabajadas'}, inplace=True)
df.rename( columns={"calif" :'calif_ocupacional'}, inplace=True)
df.rename( columns={"p47t" :'ingreso_ult_mes'}, inplace=True)
df

,edad,nivel_educativo,hs_trabajadas,calif_ocupacional,ingreso_ult_mes
0,46,1_H/Sec inc,45,2_Op./No calif.,6000.0
1,26,2_Sec. comp y más,25,2_Op./No calif.,5000.0
2,47,2_Sec. comp y más,25,2_Op./No calif.,5000.0
3,52,1_H/Sec inc,90,2_Op./No calif.,11000.0
4,45,1_H/Sec inc,44,2_Op./No calif.,9500.0
...,...,...,...,...,...
23443,45,2_Sec. comp y más,50,2_Op./No calif.,4000.0
23444,58,1_H/Sec inc,30,2_Op./No calif.,5000.0
23445,36,2_Sec. comp y más,40,2_Op./No calif.,13000.0
23446,49,1_H/Sec inc,40,2_Op./No calif.,4000.0
23447,36,1_H/Sec inc,54,2_Op./No calif.,8000.0

### 2.4 ¿Cuál es el tipo de la cuarta columna?

In [6]:
df['calif_ocupacional'].dtype

dtype('O')

In [18]:
df["calif_ocupacional"].value_counts()

2_Op./No calif.    17372
1_Prof./Tecn.       6076
Name: calif_ocupacional, dtype: int64

### 2.4 ¿Cuál es el nivel educativo más común?

In [7]:
df["nivel_educativo"].value_counts()

2_Sec. comp y más    14634
1_H/Sec inc           8814
Name: nivel_educativo, dtype: int64

### 2.5 ¿Y cómo se distribuye la población según calificación?

In [8]:
df["calif_ocupacional"].value_counts()

2_Op./No calif.    17372
1_Prof./Tecn.       6076
Name: calif_ocupacional, dtype: int64

### 2.6 ¿Cuál es el ingreso total de la población?

In [9]:
df["ingreso_ult_mes"].sum()

190114176.0

### 2.4 ¿Cuál es el ingreso medio de la población?

In [10]:
df["ingreso_ult_mes"].mean()

8107.905834186285

## 3. Indexando y ordenando los datos

### 3.1 Seleccionar la columna `nivel_educativo` e `ingreso_ult_mes` y asignarlas a un objeto nuevo llamado `df2`

In [11]:
df2=df[['nivel_educativo', 'ingreso_ult_mes']]
df2

         nivel_educativo  ingreso_ult_mes
0            1_H/Sec inc           6000.0
1      2_Sec. comp y más           5000.0
2      2_Sec. comp y más           5000.0
3            1_H/Sec inc          11000.0
4            1_H/Sec inc           9500.0
...                  ...              ...
23443  2_Sec. comp y más           4000.0
23444        1_H/Sec inc           5000.0
23445  2_Sec. comp y más          13000.0
23446        1_H/Sec inc           4000.0
23447        1_H/Sec inc           8000.0

[23448 rows x 2 columns]

### 3.2 Seleccionar de df2 las primeras 20 filas

In [13]:
df2.head(3)

     nivel_educativo  ingreso_ult_mes
0        1_H/Sec inc           6000.0
1  2_Sec. comp y más           5000.0
2  2_Sec. comp y más           5000.0

### 3.2 Seleccionar de df una muestra aleatoria de 500 filas

In [14]:
df.sample(n=5, random_state=1)

,edad,nivel_educativo,hs_trabajadas,calif_ocupacional,ingreso_ult_mes
14513,36,1_H/Sec inc,15,2_Op./No calif.,2500.0
15803,44,2_Sec. comp y más,25,1_Prof./Tecn.,13000.0
8670,55,2_Sec. comp y más,40,2_Op./No calif.,11000.0
13826,42,2_Sec. comp y más,56,2_Op./No calif.,8000.0
9374,25,2_Sec. comp y más,8,2_Op./No calif.,1500.0

### 3.4 Elegir todas las columnas, con excepción de nivel_educativo. Tip: Utilizar la propiedad columns para filtrar en la dimensión de las columnas.

In [15]:
df.drop("nivel_educativo",axis=1)

       edad  hs_trabajadas calif_ocupacional  ingreso_ult_mes
0        46             45   2_Op./No calif.           6000.0
1        26             25   2_Op./No calif.           5000.0
2        47             25   2_Op./No calif.           5000.0
3        52             90   2_Op./No calif.          11000.0
4        45             44   2_Op./No calif.           9500.0
...     ...            ...               ...              ...
23443    45             50   2_Op./No calif.           4000.0
23444    58             30   2_Op./No calif.           5000.0
23445    36             40   2_Op./No calif.          13000.0
23446    49             40   2_Op./No calif.           4000.0
23447    36             54   2_Op./No calif.           8000.0

[23448 rows x 4 columns]

### 3.5 Ordenar el dataset según la edad

In [16]:
df.sort_values(by=['edad'])

,edad,nivel_educativo,hs_trabajadas,calif_ocupacional,ingreso_ult_mes
15308,12,1_H/Sec inc,7,2_Op./No calif.,250.0
19856,12,1_H/Sec inc,15,2_Op./No calif.,1200.0
20050,12,1_H/Sec inc,20,2_Op./No calif.,1600.0
5698,12,1_H/Sec inc,5,2_Op./No calif.,250.0
14556,13,1_H/Sec inc,14,2_Op./No calif.,800.0
...,...,...,...,...,...
4340,84,1_H/Sec inc,36,2_Op./No calif.,7500.0
23317,84,1_H/Sec inc,25,2_Op./No calif.,9900.0
16461,85,2_Sec. comp y más,40,1_Prof./Tecn.,20700.0
16954,85,2_Sec. comp y más,36,2_Op./No calif.,8250.0
22574,93,1_H/Sec inc,20,2_Op./No calif.,8000.0

### 3.6 ¿Cuál es el promedio de horas trabajadas de los jóvenes entre 14 y 25 años y poco calificados?

In [36]:
df3=df[((df["edad"] > 13) & (df["edad"] < 26) & (df["calif_ocupacional"] == "2_Op./No calif."))]
df3["edad"].mean()

22.036245016310257

In [42]:
df3.head(2)

    edad    nivel_educativo  hs_trabajadas calif_ocupacional  ingreso_ult_mes
8     24        1_H/Sec inc             55   2_Op./No calif.           3800.0
21    25  2_Sec. comp y más             36   2_Op./No calif.           6500.0

### 3.7 Generar un dataframe nuevo con los trabajadores que ganan más del promedio de ingresos general y están por debajo de la cantidad media de horas trabajadas. ¿Cuántos trabajadores se encuentran en esta condición? ¿Cuál es su edad mediana?

In [46]:
MG = df["ingreso_ult_mes"].mean()
MHT = df["hs_trabajadas"].mean()
df4 = df[(df["ingreso_ult_mes"] > MG) & (df["hs_trabajadas"] < MHT)]
df4

,edad,nivel_educativo,hs_trabajadas,calif_ocupacional,ingreso_ult_mes
10,72,1_H/Sec inc,15,1_Prof./Tecn.,8300.0
12,43,2_Sec. comp y más,15,1_Prof./Tecn.,11000.0
47,33,2_Sec. comp y más,39,1_Prof./Tecn.,9500.0
48,55,1_H/Sec inc,30,2_Op./No calif.,13000.0
88,46,1_H/Sec inc,36,1_Prof./Tecn.,10000.0
...,...,...,...,...,...
23393,30,2_Sec. comp y más,30,2_Op./No calif.,10000.0
23397,46,2_Sec. comp y más,36,2_Op./No calif.,10100.0
23398,38,2_Sec. comp y más,35,2_Op./No calif.,8500.0
23430,62,2_Sec. comp y más,30,1_Prof./Tecn.,8500.0
23442,41,2_Sec. comp y más,39,2_Op./No calif.,9500.0

In [63]:
df4["edad"].median()

44.0

In [60]:
df4.describe()

              edad  hs_trabajadas  ingreso_ult_mes
count  2132.000000    2132.000000      2132.000000
mean     45.046904      28.575047     13718.699343
std      12.900320       7.192760      7637.810681
min      18.000000       1.000000      8150.000000
25%      35.000000      25.000000      9800.000000
50%      44.000000      30.000000     11900.000000
75%      54.000000      35.000000     15000.000000
max      85.000000      39.000000    130000.000000

### Extra
¿Cuál es la ingreso que tiene como mínimo el 10% más de todos los trabajadores?

In [68]:
#Piden calcular el percentil 90,usamos quantile y el porcentaje.

df["ingreso_ult_mes"].quantile(0.9)

#El resultado es que el 10% con más ingresos tiene como mínimo:

15000.0